app/helpers/carts_helper.rb

  def cart_total
    @total = 0
    current_user_cart_content.each do |cart_item|
      @total = @total + (Item.find(cart_item.item_id).price * cart_item.quantity)
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]