app/controllers/application_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2022-11-29 14:31:33.396324"], ["updated_at", "2022-11-29 14:31:33.396324"]]
---
  def initialize_cart
    @cart ||= Cart.find_by(id: session[:cart_id])
    if current_user
      if @cart.nil?
        @cart= Cart.create(user_id: current_user.id)