app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_cart
      @cart = Cart.find(current_user_cart.id)