app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
  def show
    @render_cart = false
    @cart_content = Cart.find_by(user_id: current_user.id).items