app/controllers/checkout_controller.rb

  def success
    @session = Stripe::Checkout::Session.retrieve(params[:session_id])
    @payment_intent = Stripe::PaymentIntent.retrieve(@session.payment_intent)
    new_order = Order.create(user_id: current_user.id)
    current_user_cart_content.each do |cart_item|
      JoinTableOrderItem.create(order_id: new_order.id, item_id: cart_item.id)
    end
    JoinTableCartItem.where(cart_id: current_user_cart.id).destroy_all
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2022-11-30 12:43:05.029119"], ["updated_at", "2022-11-30 12:43:05.029119"]]
INSERT INTO "join_table_order_items" ("order_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 1], ["item_id", 1], ["created_at", "2022-11-30 12:43:05.731500"], ["updated_at", "2022-11-30 12:43:05.731500"]]
DELETE FROM "join_table_cart_items" WHERE "join_table_cart_items"."id" = $1  [["id", 1]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 1]]