app/controllers/join_table_cart_items_controller.rb

    def create
      @itemToAdd = JoinTableCartItem.new(cart_id: current_user.cart.id, item_id: params[:id])

      respond_to do |format|
        if @itemToAdd.save
---
INSERT INTO "join_table_cart_items" ("cart_id", "item_id", "item_quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 1], ["item_id", 1], ["item_quantity", nil], ["created_at", "2022-11-30 10:54:21.042448"], ["updated_at", "2022-11-30 10:54:21.042448"]]

    def destroy
      @item_to_delete = JoinTableCartItem.find(params[:item_to_delete])
      @item_to_delete.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "join_table_cart_items" WHERE "join_table_cart_items"."id" = $1  [["id", 6]]